{
    "releases": [
        {
            "tag_name": "v2.4.6",
            "name": "v2.4.6",
            "published_date": "January 29, 2026",
            "body": "Changes:\r\n- Removed all uses of auth.roblox.com/v1/logout to get the csrf token\r\n- Fixed the quick play button snapping when added to featured games containers. Thanks to alice for the help.\r\n- Fixed recent servers duplicating when spam clicking refresh.\r\n- Fixed https://github.com/NotValra/RoValra/issues/34\r\n- Updated the quickplay.scss to be readable lol\r\n- Changed quickplay private server name from dompurify to safeHtml since it is better for that use case.\r\n- Moved more css to a .scss file\r\n- Fixed what am i joining server id sometimes going on a different line if too long\r\n- Fixed corrupted preferred region value not being reset to the default",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4.6",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4.5",
            "name": "v2.4.5",
            "published_date": "January 25, 2026",
            "body": "New stuff:\r\n- Added rovalra latency simulation to developer settings.\r\n- Added a \"Do not show again\" button to the review pop up\r\n- Added Region and place version to private servers.\r\n- Added quick private server link copy and regenerate\r\n\r\nChanges:\r\n- Fixed an issue where an important part of the script would blindly accept corrupted information breaking parts of the extension.\r\n- Fixed server performance sometimes showing when server list modifications is disabled\r\n- Fixed Server list filters not being added when server list modifications is disabled.\r\n- Fixed quickplay covering friends in some cases.\r\n- Updated the fishstrap share link to their new link",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4.5",
            "chrome_release_date": "January 27, 2026",
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4.4",
            "name": "v2.4.4",
            "published_date": "January 22, 2026",
            "body": "New stuff:\r\n- Added recent servers.\r\n- Added a thing to make it possible for Roblox to tell what traffic comes from RoValra to help the people at Roblox yay\r\n\r\nchanges\r\n- Changed the 40% method to automatically create and update the game so you dont have to go in studio and do it manually.\r\n- Fixed some api requests happening a bit too much\r\n- Improved preferred region.\r\n- Fixed owner text on improved join modal being white on light mode making it not visible\r\n- Fixed unpending robux accidently sanitizing html.\r\n- Fixed hidden experiences issues.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4.4",
            "chrome_release_date": "January 24, 2026",
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4.3",
            "name": "v2.4.3",
            "published_date": "January 19, 2026",
            "body": "Additions\r\n- Added server Ip and Datacenter id to the server list (off by default)\r\n- Added a pop up asking for a review, which is made in a way where it doesnt force you to leave a review and it isnt annoying.\r\n\r\nchanges\r\n- Removed private inventory checker as Roblox patched it.\r\n- Fixed streamer mode robux hiding not hiding robux in places where it should have\r\n- Made the donation button not show on your profile.\r\n- Fixed possible issues where the extension would try and get data before the website was done loading\r\n- Changed the \"player count unknown\" when using the region filter to random thumbnails with a tooltip explaining\r\n- Changed the subplace tab to be on the same line as other tabs instead of below\r\n- Attempted to improve the join closest server to be way more consistent.\r\n- Removed the \"Start server\" when no server is running and instead made it start automatically.\r\n- Fixed quick outfits not handling width of the ui being too small correctly\r\ndevelopment changes\r\n- moved most the css to different files for maintainability.\r\n- made configs for development making it easier to find stuff that should be done differently or stuff like unsafe innerhtml\r\n- made a new sanitizer that uses dompurify + some custom logic to make it easier to add and use.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4.3",
            "chrome_release_date": "January 21, 2026",
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4.2",
            "name": "v2.4.2",
            "published_date": "December 30, 2025",
            "body": "This is gonna be the last update for a little while now.\r\n\r\nAlso it is rovalras anniversary today yay\r\n \r\nNew stuff\r\n- Added a site fix for experience title text getting cut off at the top and bottom on profiles.\r\n- Added a thing making \"What am i joining\" close when clicking the background, which is on by default but can be disabled.\r\nFixes/Changes\r\n- Fixed there not being a download button in \"What Am I joining\" if you dont have the client installed\r\n- Fixed inventory checker loading on pages it shouldnt\r\n- Fixed bundles not working with the 40% method\r\n- Added update detection that tells you if your 40% method game is outdated.\r\n- Added a little review reminder to the popup when pressing the extensions logo.\r\n- Started changing all color stuff to variables like how it should have been from the start\r\n- Fixed searching in settings not working",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4.2",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4.1",
            "name": "v2.4.1",
            "published_date": "December 27, 2025",
            "body": "New Features\r\n- Added total Earned (Thanks to Kanibal02 on github for contributing)\r\n- Added more sorting to Hidden Experiences on groups and profiles (Thanks to Zed128 for contributing)\r\n- Added Roblox API documentation that documents apis the extension found while you were using Roblox (Developer setting)\r\n- Added Quick outfit switching to game pages (off by default)\r\n\r\nFixes / changes\r\n- Fixed a setting being out of sync\r\n- Reduced the file size.\r\n- Fixed onboarding not scaling with different screen sizes\r\n- Fixed sorting by recently updated not sorting correctly (Thanks to Zed128 for contributing)\r\n- Fixed badges not supporting legacy profile",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4.1",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4",
            "name": "Update 2.4",
            "published_date": "December 24, 2025",
            "body": "This update was in the making for quite a while\r\n\r\nNew features\r\n- Completely reworked the entire extensions optimization to future proof it.\r\n- Added a thing showing what server id, region, place version etc you are joining if the data is there.\r\n- Added a Private Server Quick play feature, basically allowing you to quickly join private servers by using the quick play feature.\r\n- Added a donation button on peoples profiles allow you to easily donate via pls donate to someone.\r\n- Added an Outfit viewer, allowing you to view the outfits a user saved.\r\n- Added a total spent feature allowing you to see how much u spent on roblox in total\r\n- Added privacy features, one that spoofs ur online status to being in studio and one that spoofs it as offline , thanks to Julia for the help.\r\n- Added RAP on peoples profile, and when pressed it will show you the users limiteds.\r\n- Added a quick ban and anti bot feature, basically allowing you to quickly ban people in groups and quickly scan and ban possible bots in groups.\r\n- Added an item filter to the avatar editor, allowing you to filter by lots of different things like effects, limited etc\r\n- Added a search bar to the avatar editor allowing you to quickly search for items.\r\n- Added a setting used by Roblox staff as a setting inside the developer settings, it adds a “impersonate” button a users profile.\r\n- Recoded the user hidden experiences from scratch making it a lot better, and adding filters, credits to zed256 for making a proof of concept.\r\n- Reworked the preferred region play button to join the server closest to you instead of you having to pick one (The old version is still there)\r\n- Added a streamer mode.\r\n- Added a setting to enable Roblox's official early access programs ui in settings, It doesnt allow you to join any programs and its just for show\r\n- Added a way to easily save 40% Robux when buying avatar items, and 10% Robux when buying gamepasses.\r\n- Added a feature that prevents the memory of Roblox Tabs from increasing over time to speed up loading and responsiveness of the site.\r\n- Added a fix for the buttons to open up continue playing and Favorites and more being the width of the entire page with 90% of that is invisible to the user.\r\n- Added server performance to the serverlist \r\n- Added Version filters to the server list, allowing you to filter by servers running on a specific version.\r\n- Added an option that simulates RoValra downtime (in developer settings)\r\n- Added an option to join a different region if no server was found in the region you are trying to join.\r\n- Added a way to view item dependencies like meshes and textures on items\r\n- Added support for client only experience trailers.\r\n- Reworked the serverlist to look way better and generally fit in with roblox more, and a bit of the filtering to work better and be easier to understand and read.\r\n- Reworked the instant joiner ui to look better and fit in more with Roblox, and added game filters.\r\n- Reworked multiple uis to fit in more with Roblox.\r\n- Reworked the subplaces feature, the code was old and messy, and now it should work better and be easier to use.\r\n\r\nChanges\r\n- Fixed the settings page not scaling with different screen sizes.\r\n- Attempted to fix a crash related to the region selector.\r\n- Quality of Life improvements and ui improvements and other misc changes to the settings page\r\n- Countless changes to basically every script in the extension to attempt to make it more optimized and over all a smoother experience\r\n- Removed the css fix for profile pictures squishing since Roblox fixed it. Instead I renamed the css fixes to site fixes and added new fixes.\r\n- Changed some styling on the private server bulk set inactive / active to fit in more.\r\n",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4-beta.4",
            "name": "v2.4-beta.4",
            "published_date": "December 22, 2025",
            "body": "Changes\r\n- Fixed inactive private servers showing in quick play\r\n- Fixed quick ban / anti bot issues.\r\n- private inventory checker ported.\r\n- Fixed images not showing on the globe.\r\n- Fixed sometimes a servers city would only be shown and not city + region\r\n- Added btroblox support to hidden games\r\n- Fixed roseal incompatibility with the avatar editor filters\r\n- Added proper support for roseals server list\r\n- Fixed some minor styling issues with the quickplay\r\n- Ported sales and revenue feature as a deprecated feature\r\n- Fixed avatar filters being able to load any page if the right conditions were met\r\n- Made the 40% method not use a cors work aka full release ready\r\n- Attempted to make closest region setting more consistently find the closest region.\r\n- Added settings for the different filter options in the server list\r\n- fixed thumbnail issues with outfits viewer\r\n- removed cors proxy as it is not needed anymore",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4-beta.4",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4-beta.3",
            "name": "v2.4-beta.3",
            "published_date": "December 20, 2025",
            "body": "Hopefully full release will be done soon\r\n\r\nchanges\r\n- Fixed the globe taking a bit too long to load.\r\n- Fixed the place version a server is running sometimes not being displayed\r\n- Renamed the \"Anti Account Stalking\" Tab to \"Privacy\" to allow for more privacy focused features\r\n- Added a streamer mode.\r\n- Fixed a few misc bugs related to developing.\r\n- Added a markdown test page as an easter egg out of pure boredom\r\n- Added a bunch of xss safety to pretty much everything just in case.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4-beta.3",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4-beta.2",
            "name": "v2.4-beta.2",
            "published_date": "December 19, 2025",
            "body": "This fixes bugs, and adds some nice qol additions. Thanks to everyone who helped bug hunt!!\r\n\r\n\r\n**Changes**\r\n- Fixed margin issue in the bots text.\r\n- Added root place tag to the rootplace of the subplace\r\n- Fixed the quickplay being in places where it shouldn't\r\n- Fixed some quickplay issues\r\n- Fixed total spent api error handling.\r\n- Fixed settings page z-index being a dumb high number\r\n- Fixed some onboarding issues\r\n- Fixed server info in the join modal getting stuck waiting for client when joining experiences you dont have access to\r\n- Added improved tags to the settings page\r\n- Fixed some incorrect descriptions on the settings page\r\n- Added an option to always show developer settings preventing you from having to do the easter egg everytime",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4-beta.2",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.4-beta.1",
            "name": "v2.4-beta.1",
            "published_date": "December 18, 2025",
            "body": "**v2.4 beta 1 of the big rework!!!!**\r\n\r\nThis is not the final release. 3 features are yet to be ported and please report any of the bugs  you may find.\r\n\r\n**New features**\r\n- Completely reworked the entire extensions optimization to future proof it.\r\n- Added a thing showing what server id, region, place version etc you are joining if the data is there.\r\n- Added a Private Server Quick play feature, basically allowing you to quickly join private servers by using the quick play feature.\r\n- Added a donation button on peoples profiles allow you to easily donate via pls donate to someone.\r\n- Added an Outfit viewer, allowing you to view the outfits a user saved.\r\n- Added a total spent feature allowing you to see how much u spent on roblox in total\r\n- Added anti stalking features, one that spoofs ur online status to being in studio and one that spoof you as offline. thanks to Julia for the help.\r\n- Added RAP on peoples profile, and when pressed it will show you the users limiteds.\r\n- Added a quick ban and anti bot feature, basically allowing you to quickly ban people in groups and quickly scan and ban possible bots in groups.\r\n- Added an item filter to the avatar editor, allowing you to filter by lots of different things like effects, limited etc\r\n- Added a search bar to the avatar editor allowing you to quickly search for items.\r\n- Added a setting used by Roblox staff as a setting inside the developer settings, it adds a “impersonate” button a users profile.\r\n- Added a setting to enable Roblox's official early access programs ui in settings, It doesnt allow you to join any programs and its just for show (developer settings)\r\n- Added a way to easily save 40% Robux when buying avatar items, and 10% Robux when buying gamepasses.\r\n- Added a feature that prevents the memory of Roblox Tabs from increasing over time to speed up loading and responsiveness of the site.\r\n- Added a fix for the buttons to open up continue playing and Favorites and more being the width of the entire page with 90% of that is invisible to the user.\r\n- Added server performance to the serverlist \r\n- Added Version filters to the server list, allowing you to filter by servers running on a specific version.\r\n- Added an option that simulates RoValra downtime (in developer settings)\r\n- Added an option to join a different region if no server was found in the region you are trying to join.\r\n- Added a way to view item dependencies like meshes and textures on items\r\n- Added support for client only experience trailers.\r\n- Reworked the serverlist to look way better and generally fit in with roblox more, and a bit of the filtering to work better and be easier to understand and read.\r\n- Reworked the instant joiner ui to look better and fit in more with Roblox, and added game filters.\r\n- Reworked multiple uis to fit in more with Roblox.\r\n- Reworked the subplaces feature, the code was old and messy, and now it should work better and be easier to use.\r\n- Recoded the user hidden experiences from scratch making it a lot better, and adding filters, credits to zed256 for making a proof of concept.\r\n- Reworked the preferred region play button to join the server closest to you instead of you having to pick one (The old version is still there)\r\n**Changes**\r\n- Changed some styling on the private server bulk set inactive / active to fit in more.\r\n- Fixed the CSS fixes breaking some RoQoL features and RoSeal features\r\n- Fixed the settings page not scaling with different screen sizes.\r\n- Attempted to fix a crash related to the region selector.\r\n- Quality of Life improvements and ui improvements and other misc changes to the settings page\r\n- Countless changes to basically every script in the extension to attempt to make it more optimized and over all a smoother experience\r\n- Removed the css fix for profile pictures squishing since Roblox fixed it. Instead I renamed the css fixes to site fixes and added new fixes.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.4-beta.1",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.3.2",
            "name": "hotfix 2.3.2",
            "published_date": "October 29, 2025",
            "body": "Edit: bug fixes / updates unrelated to 2.4 will not be uploaded here to prevent confusion with the source code difference. They will only be uploaded on the chrome webstore until 2.4 is released\r\n\r\n**changes**\r\n- added support for the new Roblox profile ui\r\n- made the instant joiner on by default",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.3.2",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.3.1.9",
            "name": "v2.3.1.9",
            "published_date": "October 26, 2025",
            "body": "**Changes**\r\n- Removed servers under 1 hour of uptime saying \"new server\" since it was useless.\r\n- Added quickplay support to groups.\r\n- Made subplaces titles able go down to 2 lines instead of just one.\r\n- Fixed a vuln (thanks to zeg for reporting)\r\n\r\nIm still working on v2.4 this update just had to get pushed for safety reasons, so I decided to include some other quality of life changes with it.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.3.1.9",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.3.1.8",
            "name": "update 2.3.1.8",
            "published_date": "September 25, 2025",
            "body": "**Changes**\r\n- Every change is related to Roblox updating the server list API and me adding support for the change before they roll it out to everyone.\r\n- Removed the user sniper since the api update will completely patch it (thank you Roblox)\r\n- Removed some server list filters as they would also be effected by the api update.\r\n- Added a fallback for the region selector to use RoValra's api to get servers cuz of the api change.\r\n- Added a fallback for the preferred region play button to use RoValra's api to get servers cuz of the api change.\r\n\r\n**This update is just a quick patch, the bigger update that im working on (v2.3.2) is still being worked on.**",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.3.1.8",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.3.1.7",
            "name": "2.3.1.7",
            "published_date": "August 30, 2025",
            "body": "**Changes**\r\n- Removed a limit in the quick play and Preferred region play button that made it unable to search more than 20 pages. Completely forgot about this limit and only just noticed, now they should consistently find the region you want in bigger games.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.3.1.7",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.3.1.6",
            "name": "update 2.3.1.6",
            "published_date": "August 27, 2025",
            "body": "**Changes**\r\n- Disabled a feature that was accidently left on by default which was not meant to be public, and anyone who used it got refunded.\r\n- Fixed some overlapping issues.\r\n- Added woozynate to the credits for making fisch which is where Gilbert (the logo) is from.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.3.1.6",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.3.1.5",
            "name": "update 2.3.1.5",
            "published_date": "August 26, 2025",
            "body": "**Changes**\r\n- Updated the server version to support a 1 letter capitalization Roblox did 💔\r\n- Updated text saying the hidden catalog was patched to saying it was unpatched (Roblox works in interesting ways)",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.3.1.5",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.3.1",
            "name": "v2.3.1",
            "published_date": "August 25, 2025",
            "body": "**New Features**\r\n- Added server version to the server list (shows the game version the server is running on), And recoded the script that adds that stuff.\r\n- Added an export and import settings feature.\r\n- Added a thing displaying the current game version and the oldest game version a server is running on.\r\n- Added a RoValra badge for people who contributed to the project <3\r\n- Made the hidden games on profiles show more hidden games.\r\n- Improved the filter by oldest / newest servers by making it way more accurate.\r\n- Server Side Improvements and optimization (Backend stuff)\r\n\r\n**Changes**\r\n- Made it clear to a user that some regions arent running 24/7 to prevent confusion. \r\n- Disabled the Quick Private server link copying for maintenance.\r\n- Fixed the hidden user experiences removing elements that it shouldnt.\r\n- Fixed the Quick Play button only working on the home page, and a lot other improvements.\r\n- Fixed a bug where the globe would not add new regions, and made other improvements.\r\n- Fixed the Instant Join button showing on your profile.\r\n- Removed the tabs permission.\r\n- Small fixes to improve the extensions compatibility",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.3.1",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "v2.3",
            "name": "v2.3",
            "published_date": "August 21, 2025",
            "body": "**New Features**\r\n- Added a quick play button, with preferred region support.\r\n- Added custom RoValra badges for the Roblox badges section, for specific users only. If you contributed to RoValra in a meaningful way and you want a badge pls lmk.\r\n- Added secret / developer settings.\r\n- Added a search bar to settings.\r\n- Added support for filtering by lowest player count and highest player count when using the region selector.\r\n- Added support for excluding full servers when using the server uptime filter.\r\n- Added bulk setting private servers inactive and active.\r\n\r\n**Changes**\r\n- Made the hidden catalog disabled by default since Roblox patched it :broken_heart:\r\n- Fixed the preferred Region Play Button not having full light mode support (kinda forgot about that)\r\n- Fixed the Remove R6 Warning breaking stuff\r\n- Fixed hidden games on groups showing up where they shouldnt.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/v2.3",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.2.31",
            "name": "v2.2.31",
            "published_date": "August 19, 2025",
            "body": "**Changes**\r\n- Fixed a bug where the filters would not show if a user is using a different language than english.\r\n*This fix was made very fast at like 11 pm*",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.2.31",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.2.30",
            "name": "Updated 2.2.30",
            "published_date": "August 17, 2025",
            "body": "\r\nChanges\r\n- Updated back to v2.2.2 after the rollback.\r\n- Fixed the extension not working if the RoValra servers has issues.\r\n- Optimized the Servers (Backend)",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.2.30",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.2.2",
            "name": "Update 2.2.2",
            "published_date": "August 14, 2025",
            "body": "**I recommend downloading the RoValra.zip since the source seems to be missing some images**\r\n\r\n**New features**\r\n- **Uptime Server Tracking FOR FREE YIPPEEEE!**\r\n- Reworked the servers list, by adding region and uptime, and improving the share button and showing full server id. \r\n- Completely reworked the region selector and added it to the servers list filter (and removed the old one)\r\n- Added filters to the servers list allowing a user to filter by region, newest / oldest servers, random servers, Smallest servers, Available space, And servers with less than a specific amount of players.\r\n- Added a CSS fix for the avatar icon on users profile sometimes squishing (happens mostly when using a lot of extensions, and this is a Roblox issue which I fixed)\r\n- Made the region selector automatically support new Roblox Datacenters (Hopefully this works)\r\n\r\n**Changes**\r\n- Added support for the new Roblox community experiences UI (The UI experimental and has not fully rolled out)\r\n- Added support for checking hidden experiences on communities if they dont have any none hidden experiences\r\n- Added support for the react avatar editor on the r6 warning feature.\r\n- Replaced the old region selector with a ui letting the user know where the new one is.\r\n- Fixed Hidden user games not working in the new BTRoblox update \r\n- Fixed subplace tab not always getting added.\r\n- Removed the R6 fix cuz it was buggy and poorly made.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.2.2",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.2.1",
            "name": "Update 2.2.1",
            "published_date": "July 13, 2025",
            "body": "**Changes**\r\n- added RoQol as an easter egg\r\n- fixed an issue where RoValra were removing the edit game button.\r\n- fixed preferred region loading speed \r\n- fixed preferred region missing some regions.\r\n- Private inventory checker showing up on the groups part if using BTRoblox and the user isnt in any groups\r\n- Attempted to fix the subplace issue (again)\r\n- Fixed some misinformation on the settings page, and made other stuff a bit clearer",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.2.1",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.2",
            "name": "Update 2.2",
            "published_date": "June 25, 2025",
            "body": "**New features**\r\n- Bot detection that shows if a Roblox game is botted.\r\n- Estimated unpending robux for transactions page (Should work butttttt might not i couldnt really test it.)\r\n- Redesigned settings page (again)\r\n- Reworks of some older features, to make them better and less ugly / buggy\r\n- Finally fixing the invite feature (I HATE CODING THIS SO MUCH)\r\n- Quality of life changes to the server section on game pages like the full server id showing\r\n- All ban reasons, all ban durations and a little more since I randomly found them while looking for stuff.\r\n- Improvements to the simple region selector ui (i got bored)\r\n- region selector and preferred region gives you more information so a user doesnt think it broke\r\n- RoSeal easter egg page and rokitty easter egg page\r\n- Prob more I HONESTLY CANT REMEMBER IM GOING CRAZY yipe\r\n\r\n**Bug fixxies**\r\n- Hopefully fixed the subplaces tab not always showing up\r\n- Fixed the hidden user experiences button not showing up and the ui being bugged after a BTRoblox update (I believe)\r\n- Fixed the private inventory viewer not working on light mode (No idea if this was in 2.1.9 or if it came in development)\r\n- Fixed the launch logo not working with the new Roblox UI\r\n- Prob more I cannot remember.\r\n\r\n**Server uptime is still in the works. I really wanted this update out since I have been dealing with boring and annoying stuff iykyk**\r\n\r\n**If you enjoy the update / extension please feel free to leave a 5 star review on the chrome webstore**",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.2",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.1.9",
            "name": "update 2.1.9",
            "published_date": "May 06, 2025",
            "body": "**Changes**\r\n- A feature allowing you to change the logo that shows up when joining a game (Since people werent happy that roblox changed it to the new app icon)\r\n- The server id sending to my api is also being added, which u can turn off if you want to.\r\n- and bug fixes",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.1.9",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.1.8.5",
            "name": "Update 2.1.8.5",
            "published_date": "April 28, 2025",
            "body": "**Changes**\r\n- bug fixes for the known issues.\r\n- a setting to turn on and off Private inventory viewer (somehow completely forgot to add this)\r\n- did some changes to the settings page code making it a lot easier for me to add new settings.\r\n- fixed ping calulation being off on the simple region selector ui\r\n- added a button on the simple ui allowing you to check regions on a different page allowing for a lot of regions\r\n- changed sorting on the simple region selector to be based off the users location instead of what region has the most servers\r\n- Old roblox admin panel recreation easter egg :)",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.1.8.5",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.1.8",
            "name": "update 2.1.8",
            "published_date": "April 24, 2025",
            "body": "**Changes**\r\n- region selector ui rework (2 uis to choose from, 1 a lot better than the other)\r\n- join preferred region play button inspired by RoQoL\r\n- Tabs to the settings page, so each settings category like games, catalog etc would be under a tab.\r\n- multiple easter egg pages for example roblox.com/cats will have cats. \r\n- hidden catalog updating the items title if it changed while having the ability to see the original title\r\n- A thing that estimates how many robux will stop pending with 24 hours or 72 hours (Best for ugc creators and only works on groups for now.)\r\n- Made some improvements to the setting page code\r\n- general ui improvements and bug fixes.\r\n",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.1.8",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.1.7.6",
            "name": "Update 2.1.7.6",
            "published_date": "April 18, 2025",
            "body": "**Changes**\r\n- edit: the install issue wasnt fixed. The RoValra-main.3.zip has the fix.\r\n- Fixed a very rare issue where the extension would not install correctly.\r\n- Updated the hidden catalog to support my back end changes.",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.1.7.6",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.1.7.5",
            "name": "update 2.1.7.5",
            "published_date": "March 27, 2025",
            "body": "**Changes**\r\n- Removed a few lines of code that broke the entire extension :)\r\n- other bug fixes :)",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.1.7.5",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        },
        {
            "tag_name": "2.1.7",
            "name": "Update 2.1.7",
            "published_date": "March 23, 2025",
            "body": "**Changes**\r\n- Added a hidden catalog.\r\n- Reworked the private inventory checker.\r\n- Added the ability check if a user with a private inventory owns a bunch of different items.\r\n- Added some text on the sales and revenue if the stats are likely incorrect.\r\n- prob more i cant remember...\r\n\r\n**Fixes**\r\n\r\n- Fixed some settings not being on correctly when first installing.\r\n- Fixed some stuff related to the hidden games on groups.\r\n- Prob did more i cant remember....",
            "url": "https://github.com/NotValra/RoValra/releases/tag/2.1.7",
            "chrome_release_date": null,
            "chrome_url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli"
        }
    ],
    "chrome_extension": {
        "url": "https://chromewebstore.google.com/detail/rovalra-roblox-improved/njcickgebhnpgmoodjdgohkclfplejli",
        "version": "2.4.5",
        "is_latest": false
    },
    "error_message": null,
    "last_updated": "2026-01-31T15:07:10.047364Z"
}